cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "neovim/neovim"

brew "ack"
brew "awscli"
brew "readline"
brew "sqlite"
brew "ansible"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "bash-completion@2"
brew "cheat"
brew "cmake"
brew "coreutils"
brew "curl", args: ["with-openssl"]
brew "libevent"
brew "pcre"
brew "crystal"
brew "cscope"
brew "ctags"
brew "diff-so-fancy"
brew "elixir"
brew "exa"
brew "fd"
brew "findutils"
brew "fpp"
brew "fzf"
brew "git"
brew "gist"
brew "grc"
brew "gnu-sed", args: ["with-default-names"]
brew "heroku"
brew "jq"
brew "pinentry"
brew "gettext", link: true
brew "grep"
brew "httpie"
brew "gh"
brew "libtool"
brew "mas"
brew "neovim"
brew "nmap"
brew "node"
brew "openssh"
brew "perl"
brew "pgcli"
brew "pkg-config"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "screen"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "wifi-password"
brew "zsh"

cask "java"
cask "1password"
cask "appcleaner"
cask "blockblock"
cask "divvy"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "homebrew/cask-fonts/font-dejavu-sans-mono-for-powerline"
cask "iterm2"
cask "knockknock"
cask "macdown"
cask "ngrok"
cask "oversight"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicksilver"
cask "ransomwhere"
cask "zappy"
cask "sequel-pro"
cask "spotify"
cask "stay"
cask "sublime-text"
cask "taskexplorer"
cask "the-unarchiver"
cask "vlc"
cask "yubikey-neo-manager"
cask "sloth"

#mas "CopyClip", id: 595191960
#mas "iA Writer", id: 775737590
#mas "Todoist", id: 585829637
#mas "Xcode", id: 497799835
#mas "Slack", id: 803453959
